package Task4;

import java.util.Arrays;

// Создайте класс Train, содержащий поля: название пункта назначения, номер поезда, время отправления.
// Создайте данные в массив из пяти элементов типа Train, добавьте возможность сортировки элементов
// массива по номерам поездов. Добавьте возможность вывода информации о поезде, номер которого
// введен пользователем.
// Добавьте возможность сортировки массив по пункту назначения, причем поезда с одинаковыми пунктами
// назначения должны быть упорядочены по времени отправления
public class Main {
    public static void main(String[] args) {
        Train[] train = new Train[]{
                new Train("Minsk", 112, "12.33"),
                new Train("Berlin", 111, "00.12"),
                new Train("New York", 33, "15.55"),
                new Train("London", 55, "10.00"),
                new Train("Pinsk", 22, "22.00")
        };

        System.out.println(Arrays.toString(train));
    }
}
