public class Algorithmization2 {
    public static void main(String[] args) {
        sort0();
    }
    //---- Одномерные массивы. Сортировки ----
    // Сортировка выбором. Дана последовательность чисел.Требуется переставить элементы так,
    // чтобы они были расположены по убыванию. Для этого в массиве, начиная с первого, выбирается наибольший
    // элемент и ставится на первое место, а первый - на место наибольшего. З
    // атем, начиная со второго, эта процедура повторяется. Написать алгоритм сортировки выбором.
    public static void sort0(){

    }
}
